SELECT shohin_mei, shohin_bunrui, hanbai_tanka,
AVG (hanbai_tanka) OVER (ORDER BY shohin_id) AS current_avg
FROM Shohin;

/*
   shohin_mei   | shohin_bunrui | hanbai_tanka |      current_avg      
----------------+---------------+--------------+-----------------------
 Tシャツ         | 衣服           |         1000 | 1000.0000000000000000
 穴あけパンチ     | 事務用品        |          500 |  750.0000000000000000
 カッターシャツ   | 衣服           |         4000 | 1833.3333333333333333
 包丁           | キッチン用品     |         3000 | 2125.0000000000000000
 圧力鍋          | キッチン用品    |         6800 | 3060.0000000000000000
 フォーク        | キッチン用品    |          500 | 2633.3333333333333333
 おろし金        | キッチン用品    |          880 | 2382.8571428571428571
 ボールペン      | 事務用品        |          100 | 2097.5000000000000000
(8 rows)
*/