SELECT shohin_id, shohin_mei, hanbai_tanka, (SELECT AVG(hanbai_tanka) FROM Shohin) AS avg_tanka
FROM Shohin;

/*
 shohin_id |   shohin_mei   | hanbai_tanka |       avg_tanka       
-----------+----------------+--------------+-----------------------
 0001      | Tシャツ         |         1000 | 2097.5000000000000000
 0002      | 穴あけパンチ     |          500 | 2097.5000000000000000
 0003      | カッターシャツ   |         4000 | 2097.5000000000000000
 0004      | 包丁            |         3000 | 2097.5000000000000000
 0005      | 圧力鍋          |         6800 | 2097.5000000000000000
 0006      | フォーク        |          500  | 2097.5000000000000000
 0007      | おろし金        |          880  | 2097.5000000000000000
 0008      | ボールペン      |          100  | 2097.5000000000000000
(8 rows)
*/