INSERT INTO ShohinJim VALUES ('0009', '印鑑', '事務用品', 95, 10, '2009-11-30');

/* INSERT 0 1 */


SELECT * FROM ShohinJim;

/*
 shohin_id |  shohin_mei  | shohin_bunrui | hanbai_tanka | shiire_tanka |  torokubi  | shohin_mei_kana 
-----------+--------------+---------------+--------------+--------------+------------+-----------------
 0002      | 穴あけパンチ   | 事務用品       |          500 |          320 | 2009-09-11 | 
 0008      | ボールペン     | 事務用品       |          100 |              | 2009-11-11 | 
 0009      | 印鑑         | 事務用品        |           95 |           10 | 2009-11-30 | 
(3 rows)
*/


SELECT * FROM Shohin;

/*
 shohin_id |   shohin_mei   | shohin_bunrui | hanbai_tanka | shiire_tanka |  torokubi  | shohin_mei_kana 
-----------+----------------+---------------+--------------+--------------+------------+-----------------
 0001      | Tシャツ         | 衣服           |         1000 |          500 | 2009-09-20 | 
 0002      | 穴あけパンチ     | 事務用品        |          500 |          320 | 2009-09-11 | 
 0003      | カッターシャツ   | 衣服            |         4000 |         2800 |            | 
 0004      | 包丁            | キッチン用品    |         3000 |         2800 | 2009-09-20 | 
 0005      | 圧力鍋          | キッチン用品    |         6800 |         5000 | 2009-01-15 | 
 0006      | フォーク        | キッチン用品     |          500 |              | 2009-09-20 | 
 0007      | おろし金        | キッチン用品     |          880 |          790 | 2009-04-28 | 
 0008      | ボールペン      | 事務用品         |          100 |              | 2009-11-11 | 
 0009      | 印鑑           | 事務用品         |           95 |           10 | 2009-11-30 | 
(9 rows)
*/