SELECT shohin_id,
       shohin_mei,
       shohin_bunrui,
       hanbai_tanka,
       (SELECT AVG(hanbai_tanka)
       FROM Shohin) AS hanbai_tanka_all
FROM Shohin;

/*
 shohin_id |   shohin_mei   | shohin_bunrui | hanbai_tanka |   hanbai_tanka_all    
-----------+----------------+---------------+--------------+-----------------------
 0001      | Tシャツ         | 衣服           |         1000 | 2097.5000000000000000
 0002      | 穴あけパンチ     | 事務用品        |          500 | 2097.5000000000000000
 0003      | カッターシャツ   | 衣服           |         4000 | 2097.5000000000000000
 0004      | 包丁            | キッチン用品    |         3000 | 2097.5000000000000000
 0005      | 圧力鍋          | キッチン用品    |         6800 | 2097.5000000000000000
 0006      | フォーク        | キッチン用品    |          500 | 2097.5000000000000000
 0007      | おろし金        | キッチン用品    |          880 | 2097.5000000000000000
 0008      | ボールペン      | 事務用品        |          100 | 2097.5000000000000000
(8 rows)
*/